#include <stdio.h>

int main() {
    char Yes_or_No;

    // เริ่มต้นโปรแกรม
    printf("| ขั้นตอนการต้มบะหมี่กึ่งสำเร็จรูป |\n");

    // ตรวจสอบว่ามีบะหมี่พร้อมเครื่องปรุงหรือไม่
    printf("ที่บ้านมีบะหมี่ไหม (Y/N): ");
    scanf(" %c", &Yes_or_No);

    if (Yes_or_No == 'n') {
        printf("| งั้นก็ไปซื้อของที่ตลาด |\n");
        printf("ของที่ตลาดหมดไหม? (y/n): ");
        scanf(" %c", &Yes_or_No);

        if (Yes_or_No == 'n') {
            printf("-> งั้นก็ซื้อมา ถ้าเงินไม่พอ ก็ให้ขอจากผู้ปกครอง ที่ไปส่งชื้อให้ <-\n");
            printf("|แล้วก็กลับบ้าน|\n");
        } else {
            printf("->ถ้าของที่ตลาดหมดก็ไปเซเว่นแทน<-\n");
            printf("|แล้วก็กลับบ้าน|\n");
        }
    }

    // ตรวจสอบแก๊ส
    printf("แก๊สหมดป่าวเปิดดูสิ๊? (y/n): ");
    scanf(" %c", &Yes_or_No);

    if (Yes_or_No == 'y') {
        printf("->ไปบอกผู้ปกครองในบ้านให้ซื้อแก๊สใหม่<-\n");
    }

    // ถ้าแก๊สมีอยู่ ก็ไปที่ขั้นตอนการต้ม
    printf(">> เปิดแก๊ส\n");
    printf(">> ต้มน้ำให้เดือด\n");
    printf("รอน้ำเดือดแล้วหรือยัง? (y/n): ");
    scanf(" %c", &Yes_or_No);

    if (Yes_or_No == 'n') {
        printf("->รอไปจนกว่าน้ำฟองจะขึ้นหรือน้ำเดือดปุ๊ดๆ<-\n");
    }

    // ใส่บะหมี่ลงไปในน้ำ
    printf(">> ใส่บะหมี่ลงไปในน้ำเดือด\n");

        printf("ในซองบะหมี่มีเครื่องปรุงไหม (Y/N): ");
    scanf(" %c", &Yes_or_No);

    if (Yes_or_No == 'n') {
        printf("| งั้นก็ไปหยิบรสดีมาใส่ช้อนเล็กหรือช้อนชา1ช้อน |\n");

    }
    printf(">> ต้มบะหมี่ประมาณ 3-5 นาที\n");

    // สุดท้าย ตักบะหมี่ใส่ชาม
    printf(">> นำบะหมี่ใส่ชาม\n");
    printf("เสร็จแล้ว! รับประทานได้เลย\n");

    return 0;
}